pruebas/results/2025-11-11_00-22-35/S2_3_proxy_rw_t4.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 4 tps: 91.88 qps: 1841.52 (r/w/o: 1289.83/367.52/184.16) lat (ms,95%): 69.29 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 4 tps: 86.50 qps: 1730.60 (r/w/o: 1211.07/346.52/173.01) lat (ms,95%): 90.78 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 4 tps: 82.80 qps: 1656.42 (r/w/o: 1159.71/331.10/165.60) lat (ms,95%): 90.78 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 4 tps: 73.70 qps: 1472.14 (r/w/o: 1030.36/294.39/147.39) lat (ms,95%): 110.66 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            51744
        write:                           14784
        other:                           7392
        total:                           73920
    transactions:                        3696   (82.08 per sec.)
    queries:                             73920  (1641.61 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          45.0277s
    total number of events:              3696

Latency (ms):
         min:                                   16.24
         avg:                                   48.71
         max:                                  404.08
         95th percentile:                      101.13
         sum:                               180031.46

Threads fairness:
    events (avg/stddev):           924.0000/25.55
    execution time (avg/stddev):   45.0079/0.01